IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2
Concrete member data Ec2

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.#ctor
Constructor

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.ColumnData
Column data

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.ExposureClassesData
Exposure classes

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.BeamData
Beam data

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.RelativeHumidity
Gets or sets the surrounding relative humidity.

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.CreepCoeffInfinityValue
type of creep coefficient

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.CreepCoeffInfinity
Gets or sets the user defined creep coefficient in infinity. If null, then we calculate them.

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.MemberImportance
Gets or sets the member importance.

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.CoeffKxForWmax
coefficient kx to increase limited concrete crack - only Dutch NAD

IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2.DeflectionRequirement
gets or set deflection requirement for deflection calculation